In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('../sample1.csv')

In [4]:
df.head()

   sno             name   age   salary     designation        mobile
0    1    shabeeh abaas  23.0  $20,000         manager  9.140098e+09
1    2  kashish agrawal  21.0  $23,000        manager   3.242343e+08
2    3     nisha shukla  22.0  $32,000  region manager  2.903482e+09
3    4     kriti rajput  22.0   $3,333             NaN           NaN
4    5     deepak gupta  23.0  $33,000         manager  2.343243e+08

In [5]:
df.isnull().sum()

sno            0
name           0
age            1
salary         1
designation    1
mobile         1
dtype: int64

In [6]:
def salary_clean(salary):
    if isinstance(salary,str):
        salary=salary.strip()
        if '$' in salary:
            salary=salary.replace('$','')
        if ',' in salary:
            salary=salary.replace(',','')
        
        return int(salary)
    return salary

In [8]:
df['salary']=df['salary'].apply(salary_clean)

In [9]:
df

   sno             name   age   salary     designation        mobile
0    1    shabeeh abaas  23.0  20000.0         manager  9.140098e+09
1    2  kashish agrawal  21.0  23000.0        manager   3.242343e+08
2    3     nisha shukla  22.0  32000.0  region manager  2.903482e+09
3    4     kriti rajput  22.0   3333.0             NaN           NaN
4    5     deepak gupta  23.0  33000.0         manager  2.343243e+08
5    6     mayank singh  23.0      NaN  region manager  2.334243e+08
6    7     aditya sagar   NaN  23333.0         manager  2.342423e+09
7    8         prashant  22.0   3333.0        director  2.324343e+07

In [10]:
df.drop(['mobile','sno','name'],axis=1,inplace=True)
df

    age   salary     designation
0  23.0  20000.0         manager
1  21.0  23000.0        manager
2  22.0  32000.0  region manager
3  22.0   3333.0             NaN
4  23.0  33000.0         manager
5  23.0      NaN  region manager
6   NaN  23333.0         manager
7  22.0   3333.0        director

In [11]:
from sklearn.impute import SimpleImputer

In [12]:
imputer=SimpleImputer()

In [14]:
cols=["age","salary"]
df[cols]=imputer.fit_transform(df[cols])

In [15]:
df

         age        salary     designation
0  23.000000  20000.000000         manager
1  21.000000  23000.000000        manager
2  22.000000  32000.000000  region manager
3  22.000000   3333.000000             NaN
4  23.000000  33000.000000         manager
5  23.000000  19714.142857  region manager
6  22.285714  23333.000000         manager
7  22.000000   3333.000000        director

In [16]:
df['designation'].value_counts()

manager           3
region manager    2
manager           1
director          1
Name: designation, dtype: int64

In [17]:
imp2=SimpleImputer(strategy='most_frequent')
df['designation']=imp2.fit_transform(df[['designation']])
df

         age        salary     designation
0  23.000000  20000.000000         manager
1  21.000000  23000.000000        manager
2  22.000000  32000.000000  region manager
3  22.000000   3333.000000         manager
4  23.000000  33000.000000         manager
5  23.000000  19714.142857  region manager
6  22.285714  23333.000000         manager
7  22.000000   3333.000000        director

In [18]:
gender=['male','female']*4
df['gender']=gender
df

         age        salary     designation  gender
0  23.000000  20000.000000         manager    male
1  21.000000  23000.000000        manager   female
2  22.000000  32000.000000  region manager    male
3  22.000000   3333.000000         manager  female
4  23.000000  33000.000000         manager    male
5  23.000000  19714.142857  region manager  female
6  22.285714  23333.000000         manager    male
7  22.000000   3333.000000        director  female

In [19]:
df.rename({'salary':'pay'},axis=1,inplace=True)
df

         age           pay     designation  gender
0  23.000000  20000.000000         manager    male
1  21.000000  23000.000000        manager   female
2  22.000000  32000.000000  region manager    male
3  22.000000   3333.000000         manager  female
4  23.000000  33000.000000         manager    male
5  23.000000  19714.142857  region manager  female
6  22.285714  23333.000000         manager    male
7  22.000000   3333.000000        director  female

In [20]:
row=[{
    'age':19,
    'pay':3333,
    'designation':'manager',
    'gender':'male'
},
{
    'age':22,
    'pay':23445,
    'designation':'manager',
    'gender':'female'
    
}]

In [21]:
df=df.append(row,ignore_index=True)
df

C:\Users\ASUS\AppData\Local\Temp\ipykernel_17684\3456989694.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(row,ignore_index=True)

         age           pay     designation  gender
0  23.000000  20000.000000         manager    male
1  21.000000  23000.000000        manager   female
2  22.000000  32000.000000  region manager    male
3  22.000000   3333.000000         manager  female
4  23.000000  33000.000000         manager    male
5  23.000000  19714.142857  region manager  female
6  22.285714  23333.000000         manager    male
7  22.000000   3333.000000        director  female
8  19.000000   3333.000000         manager    male
9  22.000000  23445.000000         manager  female

In [22]:
df['gender'].value_counts()

male      5
female    5
Name: gender, dtype: int64

In [23]:
from sklearn.preprocessing import LabelEncoder

In [24]:
gender_enc=LabelEncoder()
gender_enc.fit(df['gender'])

LabelEncoder()

In [25]:
df['gender']=gender_enc.transform(df['gender'])
df

         age           pay     designation  gender
0  23.000000  20000.000000         manager       1
1  21.000000  23000.000000        manager        0
2  22.000000  32000.000000  region manager       1
3  22.000000   3333.000000         manager       0
4  23.000000  33000.000000         manager       1
5  23.000000  19714.142857  region manager       0
6  22.285714  23333.000000         manager       1
7  22.000000   3333.000000        director       0
8  19.000000   3333.000000         manager       1
9  22.000000  23445.000000         manager       0

In [26]:
df['designation'].value_counts()

manager           6
region manager    2
manager           1
director          1
Name: designation, dtype: int64

In [27]:
from sklearn.preprocessing import OneHotEncoder

In [28]:
desig_enc=OneHotEncoder(drop='first')
desig_enc.fit(df[['designation']])

OneHotEncoder(drop='first')

In [29]:
designation_dummies=desig_enc.transform(df[['designation']]).toarray()

In [30]:
df.drop(columns=['designation'],axis=1,inplace=True)

In [31]:
df.values

array([[2.30000000e+01, 2.00000000e+04, 1.00000000e+00],
       [2.10000000e+01, 2.30000000e+04, 0.00000000e+00],
       [2.20000000e+01, 3.20000000e+04, 1.00000000e+00],
       [2.20000000e+01, 3.33300000e+03, 0.00000000e+00],
       [2.30000000e+01, 3.30000000e+04, 1.00000000e+00],
       [2.30000000e+01, 1.97141429e+04, 0.00000000e+00],
       [2.22857143e+01, 2.33330000e+04, 1.00000000e+00],
       [2.20000000e+01, 3.33300000e+03, 0.00000000e+00],
       [1.90000000e+01, 3.33300000e+03, 1.00000000e+00],
       [2.20000000e+01, 2.34450000e+04, 0.00000000e+00]])

In [32]:
df

         age           pay  gender
0  23.000000  20000.000000       1
1  21.000000  23000.000000       0
2  22.000000  32000.000000       1
3  22.000000   3333.000000       0
4  23.000000  33000.000000       1
5  23.000000  19714.142857       0
6  22.285714  23333.000000       1
7  22.000000   3333.000000       0
8  19.000000   3333.000000       1
9  22.000000  23445.000000       0

In [33]:
import numpy as np

In [34]:
data=np.hstack((designation_dummies,df.values))

In [35]:
data.shape

(10, 6)

In [36]:
desig_dummy_df=pd.DataFrame(designation_dummies)
desig_dummy_df.head()

     0    1    2
0  1.0  0.0  0.0
1  0.0  1.0  0.0
2  0.0  0.0  1.0
3  1.0  0.0  0.0
4  1.0  0.0  0.0

In [37]:
data_df=pd.concat([desig_dummy_df,df],axis=1)

In [38]:
data_df.head()

     0    1    2   age      pay  gender
0  1.0  0.0  0.0  23.0  20000.0       1
1  0.0  1.0  0.0  21.0  23000.0       0
2  0.0  0.0  1.0  22.0  32000.0       1
3  1.0  0.0  0.0  22.0   3333.0       0
4  1.0  0.0  0.0  23.0  33000.0       1

In [39]:
from sklearn.preprocessing import StandardScaler,MinMaxScaler

In [41]:
mxScaler=MinMaxScaler()
mxScaler.fit(data_df)
scaled_data=mxScaler.transform(data_df)
print(scaled_data)

[[1.         0.         0.         1.         0.56180268 1.        ]
 [0.         1.         0.         0.5        0.66292514 0.        ]
 [0.         0.         1.         0.75       0.96629251 1.        ]
 [1.         0.         0.         0.75       0.         0.        ]
 [1.         0.         0.         1.         1.         1.        ]
 [0.         0.         1.         1.         0.55216715 0.        ]
 [1.         0.         0.         0.82142857 0.67414973 1.        ]
 [0.         0.         0.         0.75       0.         0.        ]
 [1.         0.         0.         0.         0.         1.        ]
 [1.         0.         0.         0.75       0.67792497 0.        ]]

C:\Users\ASUS\miniconda3\envs\digi1\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(
C:\Users\ASUS\miniconda3\envs\digi1\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

In [42]:
stdScaler=StandardScaler()
stdScaler.fit(data_df)
scaled_data=stdScaler.transform(data_df)
print(scaled_data)

[[ 0.81649658 -0.33333333 -0.5         0.93860057  0.14434666  1.        ]
 [-1.22474487  3.         -0.5        -0.81345383  0.42356775 -1.        ]
 [-1.22474487 -0.33333333  2.          0.06257337  1.26123099  1.        ]
 [ 0.81649658 -0.33333333 -0.5         0.06257337 -1.4069126  -1.        ]
 [ 0.81649658 -0.33333333 -0.5         0.93860057  1.35430469  1.        ]
 [-1.22474487 -0.33333333  2.          0.93860057  0.11774088 -1.        ]
 [ 0.81649658 -0.33333333 -0.5         0.31286686  0.45456129  1.        ]
 [-1.22474487 -0.33333333 -0.5         0.06257337 -1.4069126  -1.        ]
 [ 0.81649658 -0.33333333 -0.5        -2.56550822 -1.4069126   1.        ]
 [ 0.81649658 -0.33333333 -0.5         0.06257337  0.46498554 -1.        ]]

C:\Users\ASUS\miniconda3\envs\digi1\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(
C:\Users\ASUS\miniconda3\envs\digi1\lib\site-packages\sklearn\utils\validation.py:1688: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['int', 'str']. An error will be raised in 1.2.
  warnings.warn(

In [43]:
print(scaled_data)

[[ 0.81649658 -0.33333333 -0.5         0.93860057  0.14434666  1.        ]
 [-1.22474487  3.         -0.5        -0.81345383  0.42356775 -1.        ]
 [-1.22474487 -0.33333333  2.          0.06257337  1.26123099  1.        ]
 [ 0.81649658 -0.33333333 -0.5         0.06257337 -1.4069126  -1.        ]
 [ 0.81649658 -0.33333333 -0.5         0.93860057  1.35430469  1.        ]
 [-1.22474487 -0.33333333  2.          0.93860057  0.11774088 -1.        ]
 [ 0.81649658 -0.33333333 -0.5         0.31286686  0.45456129  1.        ]
 [-1.22474487 -0.33333333 -0.5         0.06257337 -1.4069126  -1.        ]
 [ 0.81649658 -0.33333333 -0.5        -2.56550822 -1.4069126   1.        ]
 [ 0.81649658 -0.33333333 -0.5         0.06257337  0.46498554 -1.        ]]